Day 3 - Gear Ratios/soap12.xml

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
        <soapenv:Header>
                <s:Security xmlns:s="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soapenv:mustUnderstand="1">
                        <s:UsernameTokenu:Id="unt_20">
                                <s:Username>wasadmin</s:Username>
                                <s:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">wasadmin</s:Password>
                                <u:Created>2023-12-05T21:49:28.362Z</u:Created>
                                <s:Nonce>Y97tHgBg1NSkhakLtl6UT8KBwcpUHj2JBD5HVjR1QWa1AwFgZyQ/5VGDaS4X6JHpiN9JbL3EWjy4kCROX74m8AoD1fzcXSEtmsK0TrN/TJfcDtdkkTShKiK984jnj1y2Zwd1qflaDOsWTMckDCT59gpAjcdSMmuoYkP4hOcqNic=</s:Nonce>
                        </s:UsernameToken>
                </s:Security>
        </soapenv:Header>
        <soapenv:Body>
                <a:echoStringInput xmlns:a="http://com/ibm/was/wssample/sei/echo/">
                        <echoInput>hi</echoInput>
                </a:echoStringInput>
        </soapenv:Body>
</soapenv:Envelope>